name="黑马程序员"
address="世纪豪庭"
print("我是:"+name+",我的地址是:"+address)
name="黑马程序员"
message = "学it就来%s" % name
print(message)
class_num = 57
avg_salary = 16781
a = "python数据大学科，北京%s期，毕业平均工资：%s" % (class_num,avg_salary)
print(a)

num1=11
num2=11.232
print("数字11宽度限制5，结果是：%5d" % num1)
print("数字11.232宽度限制5，精度限制2，结果是：%5.2f" % num2)
print("数字11.232宽度限制2，结果是：%1d" % num1)
print("数字11.232宽度限制2，结果是：%2d " % num2)
print("数字11.232宽度限制2，结果是：%3d " % num2)
print("数字11.232宽度限制2，结果是：%1f " % num2)
print("数字11.232宽度限制2，结果是：%2f " % num2)
print("数字11.232宽度限制2，结果是：%3f " % num2)
print("数字11.232宽度限制2，结果是：%2.2f" % num2)
print("数字11.232宽度限制2，结果是：%7.3f  " % num2)


####################################################
name4="传智播客"
name2=2006
name3=19.99
#f:format
print(f"我是{name4},我成立于{name2},我今天的股票价格是{name3}")

####################################################
print("1乘1的结果是：%s" % (1*1))
print(f"1乘1的结果是：{1*1}")
print("字符串在python中的类型是:%s" % type("字符串"))
print(f"字符串在python中的类型是:{type("字符串")}")
######################################################








































